// OfferAgreement.jsx
import React from 'react';
import styles from './OfferAgreement.module.scss';

const OfferAgreement = () => {
  return (
    <div className={styles.offerAgreement}>
      <h1>Публичная оферта</h1>
      <h2>о заключении договора купли-продажи</h2>
      <br/>
      <h3>1. Общие положения</h3>
      <br/>
      <p>В настоящей Публичной оферте содержатся условия заключения Договора купли-продажи (далее по тексту - «Договор купли-продажи» и/или «Договор»). Настоящей офертой признается предложение, адресованное одному или нескольким конкретным лицам, которое достаточно определенно и выражает намерение лица, сделавшего предложение, считать себя заключившим Договор с адресатом, которым будет принято предложение.</p>
      <p>Совершение указанных в настоящей Оферте действий является подтверждением согласия обеих Сторон заключить Договор купли-продажи на условиях, в порядке и объеме, изложенных в настоящей Оферте.</p>
      <p>Нижеизложенный текст Публичной оферты является официальным публичным предложением Продавца, адресованный заинтересованному кругу лиц заключить Договор купли-продажи в соответствии с положениями пункта 2 статьи 437 Гражданского кодекса РФ.</p>
      <p>Договор купли-продажи считается заключенным и приобретает силу с момента совершения Сторонами действий, предусмотренных в настоящей Оферте, и, означающих безоговорочное, а также полное принятие всех условий настоящей Оферты без каких-либо изъятий или ограничений на условиях присоединения.</p>

      <h3>Термины и определения</h3>
      <br/>
      <p><strong>Договор</strong> – текст настоящей Оферты с Приложениями, являющимися неотъемлемой частью настоящей Оферты, акцептованный Покупателем путем совершения конклюдентных действий, предусмотренных настоящей Офертой.</p>
      <p><strong>Конклюдентные действия</strong> — это поведение, которое выражает согласие с предложением контрагента заключить, изменить или расторгнуть договор. Действия состоят в полном или частичном выполнении условий, которые предложил контрагент.</p>
      <p><strong>Продавец</strong> – физическое лицо, зарегистрированное в качестве самозанятого лица и применяющее специальный налоговый режим «Налог на профессиональный доход» в соответствии с Федеральным законом от 27.11.2018 N 422-ФЗ.</p>
      <p><strong>Покупатель</strong> – физическое лицо, приобретающее и оплачивающее Товар.</p>
      <p><strong>Сайт Продавца в сети «Интернет»</strong> – совокупность программ для электронных вычислительных машин и иной информации, содержащейся в информационной системе, доступ к которой обеспечивается посредством сети «Интернет» по доменному имени и сетевому адресу: <a href="https://koltsovaecoprint.ru/">https://koltsovaecoprint.ru/</a></p>
      <p><strong>Стороны Договора (Стороны)</strong> – Продавец и Покупатель.</p>
      <p><strong>Товар</strong> - товаром по договору купли-продажи могут быть любые вещи с соблюдением правил, предусмотренных статьей 129 Гражданского кодекса РФ.</p>

      <h3>2. Предмет Договора</h3>
      <br/>
      <p>По настоящему Договору Продавец обязуется передать вещь (Товар) в собственность Покупателя, а Покупатель обязуется принять Товар и уплатить за него определенную денежную сумму.</p>
      <p>Наименование, количество, а также ассортимент Товара, его стоимость, порядок доставки и иные условия определяются на основании сведений Продавца при оформлении заявки Покупателем, либо устанавливаются на сайте Продавца в сети «Интернет» <a href="https://koltsovaecoprint.ru/">https://koltsovaecoprint.ru/</a></p>
      <p>Акцепт настоящей Оферты выражается в совершении конклюдентных действий, в частности:</p>
      <ol>
        <li>действиях, связанных с регистрацией учетной записи на Сайте Продавца в сети «Интернет» при наличии необходимости регистрации учетной записи;</li>
        <li>путем составления и заполнения заявки на оформление заказа Товара;</li>
        <li>путем сообщения требуемых для заключения Договора сведений по телефону, электронной почте, указанными на сайте Продавца в сети «Интернет», в том числе, при обратном звонке Продавца по заявке Покупателя;</li>
        <li>оплаты Товара Покупателем.</li>
      </ol>
      <p>Данный перечень не является исчерпывающим, могут быть и другие действия, которые ясно выражают намерение лица принять предложение контрагента.</p>

      <h3>3. Права и обязанности Сторон</h3>
      <br/>
      <h3>Права и обязанности Продавца:</h3>
      <br/>
      <ol>
        <li>Продавец вправе требовать оплаты Товаров и их доставки в порядке и на условиях, предусмотренных Договором;</li>
        <li>Отказать в заключении Договора на основании настоящей Оферты Покупателю в случае его недобросовестного поведения, в частности, в случае:</li>
        <ol>
          <li>более 2 (Двух) отказов от Товаров надлежащего качества в течение года;</li>
          <li>предоставления заведомо недостоверной персональной информации;</li>
          <li>возврата испорченного Покупателем Товара или Товара, бывшего в употреблении;</li>
          <li>иных случаях недобросовестного поведения, свидетельствующих о заключении Покупателем Договора с целью злоупотребления правами, и отсутствии обычной экономической цели Договора — приобретения Товара.</li>
        </ol>
        <li>Продавец обязуется передать Покупателю Товар надлежащего качества и в надлежащей упаковке;</li>
        <li>Передать Товар свободным от прав третьих лиц;</li>
        <li>Организовать доставку Товаров Покупателю;</li>
        <li>Предоставить Покупателю всю необходимую информацию в соответствии с требованиями действующего законодательства РФ и настоящей Оферты;</li>
        <li>После получения оплаты от Покупателя за приобретенный Товар по настоящей Оферте, сформировать электронный чек в порядке статьи 14 Федерального закона от 27.11.2018 N 422-ФЗ и обеспечить его передачу Покупателю.</li>
      </ol>

      <h3>4. Права и обязанности Покупателя:</h3>
      <br/>
      <ol>
        <li>Покупатель вправе требовать передачи Товара в порядке и на условиях, предусмотренным Договором.</li>
        <li>Требовать предоставления всей необходимой информации в соответствии с требованиями действующего законодательства РФ и настоящей Оферты;</li>
        <li>Отказаться от Товара по основаниям, предусмотренным Договором и действующим законодательством Российской Федерации.</li>
        <li>Покупатель обязуется предоставить Продавцу достоверную информацию, необходимую для надлежащего исполнения Договора;</li>
        <li>Принять и оплатить Товар в соответствии с условиями Договора;</li>
        <li>Покупатель гарантирует, что все условия Договора ему понятны; Покупатель принимает условия без оговорок, а также в полном объеме.</li>
      </ol>

      <h3>5. Цена и порядок расчетов</h3>
      <br/>
      <p>Стоимость, а также порядок оплаты Товара определяется на основании сведений Продавца при оформлении заявки Покупателем, либо устанавливаются на сайте Продавца в сети <a href="https://koltsovaecoprint.ru/">https://koltsovaecoprint.ru/</a></p>
      <p>Все расчеты по Договору производятся в безналичном порядке.</p>

      <h3>6. Обмен и возврат Товара</h3>
      <br/>
      <ol>
        <li>Покупатель вправе осуществить возврат (обмен) Продавцу Товара, приобретенный дистанционным способом, за исключением перечня товаров, не подлежащих обмену и возврату согласно действующему законодательству Российской Федерации. Условия, сроки и порядок возврата Товара надлежащего и ненадлежащего качества установлены в соответствии с требованиями Гражданского кодекса РФ, Закона РФ от 07.02.1992 N 2300-1 «О защите прав потребителей»; Правил, утвержденных Постановлением Правительства РФ от 31.12.2020 N 2463.</li>
        <li>Требование Покупателя об обмене либо о возврате Товара подлежит удовлетворению, если Товар не был в употреблении, сохранены его потребительские свойства и имеются доказательства приобретения его у Продавца.</li>
        <li>Способы возврата Товара (возврат через курьера; пункт самовывоза (выдачи) Товара, пересылка отправления по почте; иные способы возврата) устанавливаются на сайте Продавца в сети <a href="https://koltsovaecoprint.ru/">https://koltsovaecoprint.ru/</a>.</li>
      </ol>

      <h3>7. Конфиденциальность и безопасность</h3>
      <br/>
      <p>При реализации настоящего Договора Стороны обеспечивают конфиденциальность и безопасность персональных данных в соответствии с актуальной редакцией ФЗ от 27.07.2006 г. № 152-ФЗ «О персональных данных» и ФЗ от 27.07.2006 г. № 149-ФЗ «Об информации, информационных технологиях и о защите информации».</p>
      <p>Стороны обязуются сохранять конфиденциальность информации, полученной в ходе исполнения настоящего Договора, и принять все возможные меры, чтобы предохранить полученную информацию от разглашения.</p>
      <p>Под конфиденциальной информацией понимается любая информация, передаваемая Продавцом и Покупателем в процессе реализации Договора и подлежащая защите, исключения указаны ниже.</p>
      <p>Такая информация может содержаться в предоставляемых Продавцом локальных нормативных актах, договорах, письмах, отчетах, аналитических материалах, результатах исследований, схемах, графиках, спецификациях и других документах, оформленных как на бумажных, так и на электронных носителях.</p>

      <h3>8. Форс-мажор</h3>
      <br/>
      <p>При реализации настоящего Договора Стороны обязуются не пропускать возможные форс-мажорные случаи.</p>
      <p>Стороны освобождаются от ответственности за неисполнение или ненадлежащее исполнение обязательств по Договору, если надлежащее исполнение оказалось невозможным вследствие непреодолимой силы, то есть чрезвычайных и непредотвратимых при данных условиях обстоятельств, под которыми понимаются: запретные действия властей, эпидемии, блокада, эмбарго, землетрясения, наводнения, пожары или другие стихийные бедствия.</p>
      <p>В случае наступления этих обстоятельств Сторона обязана в течение 30 (Тридцати) рабочих дней уведомить об этом другую Сторону.</p>
      <p>Документ, выданный уполномоченным государственным органом, является достаточным подтверждением наличия и продолжительности действия непреодолимой силы.</p>
      <p>Если обстоятельства непреодолимой силы продолжают действовать более 60 (Шестидесяти) рабочих дней, то каждая Сторона вправе отказаться от настоящего Договора в одностороннем порядке.</p>

      <h3>9. Ответственность Сторон</h3>
      <br/>
      <p>В случае неисполнения и/или ненадлежащего исполнения своих обязательств по Договору, Стороны несут ответственность в соответствии с условиями настоящей Оферты.</p>
      <p>Сторона, не исполнившая или ненадлежащим образом исполнившая обязательства по Договору, обязана возместить другой Стороне причиненные такими нарушениями убытки.</p>
      <p>Продавец настоящей Офертой гарантирует Покупателю, что его доходы, учитываемые при определении налоговой базы, не превысили в текущем календарном году 2,4 миллиона рублей.</p>
      <p>Продавец обязуется прекратить исполнение настоящей Оферты в случае утраты им права применять специальный налоговый режим "Налог на профессиональный доход", в том числе в случае снятия Продавца с учета в налоговом органе или несоответствия требованиям пункта 2 статьи 4 Федерального закона от 27.11.2018 N 422-ФЗ.</p>

      <h3>10. Срок действия настоящей Оферты</h3>
      <br/>
      <p>Оферта действует до момента её отзыва Продавцом.</p>
      <p>Оферта вступает в силу с момента размещения на Сайте Продавца и действует до момента её отзыва Продавцом.</p>
      <p>Продавец оставляет за собой право внести изменения в условия Оферты и/или отозвать Оферту в любой момент по своему усмотрению. Сведения об изменении или отзыве Оферты доводятся до Покупателя по выбору Продавца посредством размещения на сайте Продавца в сети «Интернет», в Личном кабинете Покупателя, либо путем направления соответствующего уведомления на электронный или почтовый адрес, указанный Покупателем при заключении Договора или в ходе его исполнения.</p>
      <p>Договор вступает в силу с момента Акцепта условий настоящей Оферты Покупателем и действует до полного исполнения Сторонами обязательств по Договору.</p>
      <p>Изменения, внесенные Продавцом в Договор и опубликованные на сайте в форме актуализированной Оферты, считаются принятыми Покупателем в полном объеме.</p>

      <h3>11. Дополнительные условия</h3>
      <br/>
      <p>Договор, его заключение и исполнение регулируется действующим законодательством Российской Федерации. Все вопросы, не урегулированные настоящей Офертой или урегулированные не полностью, регулируются в соответствии с материальным правом Российской Федерации.</p>
      <p>В случае возникновения спора, который может возникнуть между Сторонами в ходе исполнения ими своих обязательств по Договору, заключенному на условиях настоящей Оферты, Стороны обязаны урегулировать спор мирным путем до начала судебного разбирательства.</p>
      <p>Судебное разбирательство осуществляется в соответствии с законодательством Российской Федерации.</p>
      <p>Споры или разногласия, по которым Стороны не достигли договоренности, подлежат разрешению в соответствии с законодательством РФ. Досудебный порядок урегулирования спора является обязательным.</p>
      <p>В качестве языка Договора, заключаемого на условиях настоящей Оферты, а также языка, используемого при любом взаимодействии Сторон (включая ведение переписки, предоставление требований / уведомлений / разъяснений, предоставление документов и т. д.), Стороны определили русский язык.</p>
      <p>Все документы, подлежащие предоставлению в соответствии с условиями настоящей Оферты, должны быть составлены на русском языке либо иметь перевод на русский язык, удостоверенный в установленном порядке.</p>
      <p>Бездействие одной из Сторон в случае нарушения условий настоящей Оферты не лишает права заинтересованной Стороны осуществлять защиту своих интересов позднее, а также не означает отказа от своих прав в случае совершения одной из Сторон подобных либо сходных нарушений в будущем.</p>
      <p>Если на Сайте Продавца в сети «Интернет» есть ссылки на другие веб-сайты и материалы третьих лиц, такие ссылки размещены исключительно в целях информирования, и Продавец не имеет контроля в отношении содержания таких сайтов или материалов. Продавец не несет ответственность за любые убытки или ущерб, которые могут возникнуть в результате использования таких ссылок.</p>

      <h3>Реквизиты Продавца</h3>
      <br/>
      <p>Полное наименование: Кольцова Нина Александровна</p>
      <p>ИНН: 780226366952</p>
      <p>Контактный телефон: +7 950 042-35-93</p>
      <p>Контактный e-mail: <a href="mailto:koltsovaecoprint@yandex.ru">koltsovaecoprint@yandex.ru</a></p>
    </div>
  );
};

export default OfferAgreement;
