// Lessons01.js
import React from "react";

const Lesson01 = () => {
  return (
    <div>
      <div>
        <p>Самый простой способ попробовать, как оставляет свой след лист на ткани - это взять и сделать самому. Многих
          останавливает использование протравы.</p>
        <p>В стародавние времена для обработки ткани и шерсти перед крашением использовали жижу из-под точильного камня,
          золу из печи, рассол из-под квашеной капусты... разные секреты хранили старые мастера.</p>
        <p>Сейчас, конечно, все протравы можно купить. Самые популярные из них - железный и медный купорос и
          алюмокалиевые квасцы. А если у вас нет возможности их купить?!</p>
        <p>Вдруг вы на необитаемом острове или в тайге дремучей;), а вдохновение не даёт вам покоя... На помощь придёт
          ржавая железяка! Из куска старого ржавого железа, воды и уксуса можно самостоятельно настоять железную
          воду.</p>
        <p>Залейте в банку этот раствор и положите в него железяку. Через 3 дня настой станет желтеть. Процедив через
          ветошь воду, вы сможете воспользоваться великой магией химии окисленного железа.</p>
        <p>Волшебничайте!</p>

        <div>
          <video controls>
            <source
              src="/videos/lessons/Lesson1.mp4"
              type="video/mp4"
            />
            Your browser does not support the video tag.
          </video>
        </div>
      </div>
    </div>
  );
};

export default Lesson01;